update the readme and increasee the speed of the revovery batch
